// Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> среда
// 5 -> пятница

Console.Write("Введите номер дня недели: ");
string day = Console.ReadLine();

if (day == "1")
{
    Console.Write("Понедельник");
}