// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8
Console.Write("Введите число N:");
int i = 1;
int N = int.Parse(Console.ReadLine());
int b = i % 2;
int count = int.Parse(Console.ReadLine());
while (b == 0)
Console.Write()
Console.Write($"count+");